In [7]:
import pandas as pd
import numpy as np
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Anny', 'Bobby', 'Charter', 'Devendra'],
    'Age': [24, 27, 22, 32, 45, 33, 44, 20],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston','Japan','China','Singapore','India']
}

df = pd.DataFrame(data)
df

       Name  Age         City
0     Alice   24     New York
1       Bob   27  Los Angeles
2   Charlie   22      Chicago
3     David   32      Houston
4      Anny   45        Japan
5     Bobby   33        China
6   Charter   44    Singapore
7  Devendra   20        India

In [17]:
# want to change default index of row then make some column index to row label
d = df.set_index('City')
d

                 Name  Age
City
New York        Alice   24
Los Angeles       Bob   27
Chicago       Charlie   22
Houston         David   32
Japan            Anny   45
China           Bobby   33
Singapore     Charter   44
India        Devendra   20

In [19]:
d.axes

[Index(['New York', 'Los Angeles', 'Chicago', 'Houston', 'Japan', 'China',
        'Singapore', 'India'],
       dtype='object', name='City'),
 Index(['Name', 'Age'], dtype='object')]